[
    {
        "filename": "resume_c242f93b9d.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "TensorFlow",
                "Jupyter",
                "Machin Learning"
            ],
            "Certifications & Courses": [
                "Salesforce AI Associate – Salesforce",
                "Data Science For Engineers – IIT MADRAS with NPTEL(ELITE)",
                "AWS Educate – Credly"
            ],
            "Relevant Projects": [
                "Bug Vidhya (Group Project)",
                "ANPR and ATCC For Smart Traffic Management System"
            ],
            "Soft Skills": [],
            "Overall Match Score": 7,
            "Projects Relevance Score": 7,
            "Experience Relevance Score": 6,
            "Final Score": 355
        }
    },
    {
        "filename": "resume_c5bc434afc.pdf",
        "analysis": {
            "Key Skills": [
                "Backend Development",
                "Spring Boot",
                "Java",
                "RESTful APIs",
                "Database Design",
                "Teamwork",
                "Problem Solving"
            ],
            "Overall Analysis": "Aaditya Yadav is a Computer Science and Engineering student with experience in backend development, focusing on Spring Boot and Java. While he has strong foundational skills and experience in backend development and RESTful APIs, there is limited direct experience in AI, machine learning, and related technologies mentioned in the job description. His projects primarily focus on traditional software development rather than data science or machine learning tasks.",
            "Certifications & Courses": [],
            "Relevant Projects": [],
            "Soft Skills": [
                "Teamwork",
                "Communication",
                "Problem Solving"
            ],
            "Overall Match Score": 4,
            "Projects Relevance Score": 0,
            "Experience Relevance Score": 1,
            "Final Score": 30
        }
    },
    {
        "filename": "resume_c73713db85.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "IoT",
                "Machine Learning",
                "Signal Processing",
                "PyTorch",
                "Librosa"
            ],
            "Certifications & Courses": [
                "Certified in Data-analytics (using Excel)"
            ],
            "Soft Skills": [],
            "Overall Analysis": "The candidate has a background in Electronics and Communication Engineering and has some relevant projects in IoT and Machine Learning. However, the candidate's experience is limited compared to the mid-level requirements of the job and lacks technical positions, certifications, and skills in production-level AI engineering, such as Docker, Kubernetes, and certain AWS services.",
            "Relevant Projects": [
                {
                    "Name": "IOT Solutions for Senior Care",
                    "Description": "Leverages IoT technology using ESP32 to monitor senior citizens by integrating various sensors and modules. It comprises health metrics monitoring, GPS, and AI-based obstacle detection. A mobile application ensures real-time data visualization for the patients' wellbeing."
                },
                {
                    "Name": "Audio Source Separation using Python and ML",
                    "Description": "Developed a signal processing model for isolating audio components from mixed audio sources. Applied spectrum allocation techniques to enhance the separation of vocals, drums, and bass, optimizing performance with CNN-based architectures. Utilized PyTorch and Librosa for processing and analysis."
                }
            ],
            "Overall Match Score": 4,
            "Projects Relevance Score": 5,
            "Experience Relevance Score": 1,
            "Final Score": 155
        }
    },
    {
        "filename": "resume_c7672a8cc6.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "Machine Learning",
                "Deep Learning",
                "Natural Language Processing",
                "Neural Networks",
                "Databases",
                "Data Structures/Algorithms",
                "Signal Processing",
                "Wavelet-based Adaptive Filtering",
                "CNN-based Classification"
            ],
            "Certifications & Courses": [],
            "Relevant Projects": [
                {
                    "Title": "Alzheimer’s Classification using EEG",
                    "Description": "Developed a comprehensive framework for early Alzheimer's disease detection by preprocessing EEG signals with wavelet-based adaptive filtering to reduce noise and artifacts. Extracted and integrated features from time domain, frequency domain, and time-frequency domain to create a robust signal representation. Implemented a CNN-based classification model to analyze EEG signals and achieve high diagnostic accuracy."
                },
                {
                    "Title": "Abusive Tamil and Malayalam Text Detection",
                    "Description": "Developed a deep learning model to detect abusive comments in Tamil and Malayalam from YouTube using XLM-RoBERTa embedding."
                }
            ],
            "Soft Skills": [
                "Time Management",
                "Communication (Verbal and Written)",
                "Active Listening",
                "Creative Thinking",
                "Decision Making",
                "Self-Motivation",
                "Resilience",
                "Ethical Responsibility"
            ],
            "Overall Analysis": "The candidate has a strong academic background in computer science and artificial intelligence. They have relevant experience in machine learning, deep learning, and natural language processing. Their projects demonstrate hands-on experience with neural networks and CNN-based models. However, there is a lack of experience with containerization (Docker and Kubernetes), experience deploying ML models on AWS, and limited familiarity with the AWS stack (S3, Lambda, SageMaker, EC2, and CloudWatch). The candidate could benefit from additional exposure to MLOps tools like Airflow, DVC, and Feature Store (Feast), and knowledge of reinforcement learning and graph neural networks.",
            "Overall Match Score": 6,
            "Projects Relevance Score": 7,
            "Experience Relevance Score": 4,
            "Final Score": 295
        }
    },
    {
        "filename": "resume_c87dc59925.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "NumPy",
                "Pandas",
                "Java",
                "MySQL",
                "MongoDB",
                "JavaScript",
                "Spring Boot",
                "ReactJS"
            ],
            "Overall Analysis": "The resume does not fully match the job description. Krishna Bhagat has strong programming skills and relevant tools knowledge, but lacks specific experience in AI/ML, deep learning models, or experience with AWS SageMaker and other required technologies.",
            "Certifications & Courses": [],
            "Relevant Projects": [
                {
                    "Project": "Real-Time Group Chat Application",
                    "Description": "Developed a real-time group chat app with React, Spring Boot, and MongoDB for efficient data storage."
                },
                {
                    "Project": "Music App",
                    "Description": "Developed a music streaming app using Kotlin and Deezer API for accessing a vast music library."
                },
                {
                    "Project": "Air-Journey Game",
                    "Description": "Developed a customized version of Flappy Bird using Java and Swing library."
                }
            ],
            "Soft Skills": [
                "Collaboration",
                "Meeting Deadlines",
                "Adapting to New Technologies"
            ],
            "Overall Match Score": 4,
            "Projects Relevance Score": 2,
            "Experience Relevance Score": 0,
            "Final Score": 50
        }
    }
]