[
    {
        "filename": "resume_c242f93b9d.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "NumPy",
                "Pandas",
                "TensorFlow",
                "Machine Learning",
                "Frontend Development"
            ],
            "Overall Analysis": "Mahitha Kurri is a Computer Science Engineering student specializing in Artificial Intelligence with a strong foundation in Python, Machine Learning, and Data Analytics. Her technical skills and projects align well with the requirements for the AI Engineer position in Bangalore. However, she has limited experience with frameworks specific to the job like FastAPI, AWS SageMaker, and MLOps tools.",
            "Certifications & Courses": [
                "Salesforce AI Associate",
                "Data Science For Engineers – IIT MADRAS with NPTEL (ELITE)",
                "AWS Educate – Credly"
            ],
            "Relevant Projects": [
                "Bug Vidhya (Group Project): An educational website offering Python and Java tutorials.",
                "ANPR and ATCC For Smart Traffic Management System"
            ],
            "Soft Skills": [
                "Good people skills"
            ],
            "Overall Match Score": 6.5,
            "Projects Relevance Score": 5,
            "Experience Relevance Score": 6,
            "Final Score": 305
        }
    },
    {
        "filename": "resume_c5bc434afc.pdf",
        "analysis": {
            "Key Skills": [
                "Spring Boot",
                "Java",
                "RESTful APIs",
                "MySQL",
                "Object-Oriented Programming"
            ],
            "Overall Analysis": "The resume does not reflect experience in AI, Machine Learning, NLP, or relevant technologies identified in the job description. The candidate lacks relevant skills and experience in Python, NumPy, Pandas, PyTorch, TensorFlow, and Docker & Kubernetes in production. The candidate does not have a Bachelor’s Degree in the relevant field either and no involvement with AWS stack.",
            "Certifications & Courses": [],
            "Relevant Projects": [],
            "Soft Skills": [
                "Back-end Development"
            ],
            "Overall Match Score": 2,
            "Projects Relevance Score": 0,
            "Experience Relevance Score": 0,
            "Final Score": 0
        }
    },
    {
        "filename": "resume_c73713db85.pdf",
        "analysis": {
            "Key Skills": [
                "Machine Learning",
                "Data Analytics",
                "Signal Processing",
                "Python",
                "PyTorch",
                "Librosa",
                "Machine Learning in Electronics and Communications"
            ],
            "Overall Analysis": "Siddharth Saravanan's resume contains relevant technical skills but has significant gaps in experience, particularly in AI, NLP, and cloud deployments. The education and projects lack direct relevance to the job description.",
            "Certifications & Courses": [
                "Certified in Data Analytics (using Excel)"
            ],
            "Relevant Projects": [
                "IoT Solutions for Senior Care using ESP32 to monitor senior citizens with real-time health metrics monitoring and AI-based obstacle detection.",
                "Audio Source Separation using Python and ML with spectrum allocation techniques for separating audio components using CNN-based architectures and PyTorch."
            ],
            "Soft Skills": [
                "Collaboration",
                "Innovation"
            ],
            "Overall Match Score": 3,
            "Projects Relevance Score": 5,
            "Experience Relevance Score": 1,
            "Final Score": 155
        }
    },
    {
        "filename": "resume_c7672a8cc6.pdf",
        "analysis": {
            "Key Skills": [
                "Machine Learning",
                "Deep Learning",
                "Neural Networks",
                "Natural Language Processing"
            ],
            "Certifications & Courses": [],
            "Relevant Projects": [
                {
                    "Project Name": "Alzheimer’s Classification using EEG",
                    "Description": "Developed a comprehensive framework for early Alzheimer's disease detection by preprocessing EEG signals with wavelet-based adaptive filtering to reduce noise and artifacts. Extracted and integrated features from time domain, frequency domain, and time-frequency domain to create a robust signal representation. Implemented a CNN-based classification model to analyze EEG signals and achieve high diagnostic accuracy through advanced machine learning techniques."
                },
                {
                    "Project Name": "Abusive Tamil and Malayalam Text Detection",
                    "Description": "Developed a deep learning model to detect abusive comments in Tamil and Malayalam from YouTube. Used XLM-RoBERTa embedding."
                }
            ],
            "Soft Skills": [
                "Time Management",
                "Verbal and Written Communication",
                "Active Listening",
                "Creative Thinking",
                "Decision Making",
                "Self-Motivation",
                "Resilience",
                "Ethical Responsibility"
            ],
            "Overall Match Score": 6,
            "Projects Relevance Score": 7,
            "Experience Relevance Score": 5,
            "Final Score": 325
        }
    },
    {
        "filename": "resume_c87dc59925.pdf",
        "analysis": {
            "Key Skills": [
                "Python",
                "Pandas",
                "ReactJS"
            ],
            "Overall Analysis": "Krishna Bhagat's resume lacks the key requirements for the AI Engineer position. They have strong skills in Java, ReactJS, and JavaScript, but there is minimal to no experience with Python, Pandas, and related machine learning frameworks such as NumPy and PyTorch. Additionally, there is no mention of experience with deep learning models, NLP, or MLOps tools which are critical for this role. The lack of educational background in Computer Science or a related field and absence of experience in deploying ML models in production further reduce the suitability for this position.",
            "Certifications & Courses": [],
            "Relevant Projects": [
                {
                    "Project": "Music App",
                    "Technologies": [
                        "Kotlin",
                        "Deezer API"
                    ],
                    "Relevance": "Demonstrates ability to integrate APIs and handle network communication but lacks AI/ML involvement."
                }
            ],
            "Soft Skills": [
                "Teamwork",
                "Adaptability",
                "Problem-solving",
                "Meeting deadlines"
            ],
            "Overall Match Score": 3,
            "Projects Relevance Score": 2,
            "Experience Relevance Score": 1,
            "Final Score": 80
        }
    }
]